src/Catalogs/ММ_БазаДанных/ММ_БазаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ММ_БазаДанных</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ММ_Кластер1С</owners>
  <attributes>
    <name>ПутьДоФайлаCf</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинХранилище</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбновления</name>
    <type>
      <types>EnumRef.ММ_СпособыОбновления</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ММ_ТипБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайловойбазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ММ_СпособыОбновления/ММ_СпособыОбновления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_СпособыОбновления</name>
  <enumValues>
    <name>ТиповыеОбновления</name>
  </enumValues>
  <enumValues>
    <name>ИзФайлаCf</name>
  </enumValues>
  <enumValues>
    <name>НеОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ИзХранилищаКонфигурации</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ММ_ТипБазы/ММ_ТипБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_ТипБазы</name>
  <enumValues>
    <name>Файловая</name>
  </enumValues>
  <enumValues>
    <name>Серверная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ММ_БазаДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
	Возврат;
	КонецЕсли;
	Если СпособОбновления <> Перечисления.ММ_СпособыОбновления.ИзФайлаCf Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПутьДоФайлаCf"));
	КонецЕсли;

	Если СпособОбновления <> Перечисления.ММ_СпособыОбновления.ИзХранилищаКонфигурации Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПутьДоХранилища"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЛогинХранилище"));
	КонецЕсли;

	Если ТипБазы <> Перечисления.ММ_ТипБазы.Файловая Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПутьДоФайловойбазы"));
	КонецЕсли;

	Если ТипБазы <> Перечисления.ММ_ТипБазы.Серверная Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИмяБазы"));
	КонецЕсли;

	Если ТипБазы = Перечисления.ММ_ТипБазы.Серверная И Владелец = Справочники.ММ_Кластер1С.ФайловаяБаза Тогда
		ОбщегоНазначения.СообщитьПользователю("Файловая база не может быть кластером для серверного вида базы",
			ЭтотОбъект, "Владелец" , , Отказ);

	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#КонецЕсли
